Estoque/.svn/text-base/MovimentacaoEstoque.xml.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsd="http://WSDLGestaoEstoque">
   <soapenv:Header/>
   <soapenv:Body>
      <wsd:AtualizarEstoque>
         <item>
            <header>
               <numeroNotaFiscal></numeroNotaFiscal>
               <codigoSistemaRemetente>NBS</codigoSistemaRemetente>
               <codigoBpFornecedor></codigoBpFornecedor>
               <dataAtual>20170803</dataAtual>
               <numeroOrdemServico></numeroOrdemServico>
               <codigoVendaPerdidaBalcao></codigoVendaPerdidaBalcao>
               <codigoVendapendenteOficina></codigoVendapendenteOficina>
               <CNPJFilialTransferencia></CNPJFilialTransferencia>
               <dataCriacao>20170803</dataCriacao>
               <numeroVersao>1.57.32.94</numeroVersao>
               <tipoArquivo>3</tipoArquivo>
            </header>
            <item>
               <codigoItem>09129439</codigoItem>
               <quantidade>1</quantidade>
               <tipoItem>1</tipoItem>
               <precoCusto>10.000</precoCusto>
               <precoCustoMedio>0.010</precoCustoMedio>
               <precoVenda>75.950</precoVenda>
               <tipoRegistroMovimentacao>0001</tipoRegistroMovimentacao>
               <codigoFilialNBS>10964940000154</codigoFilialNBS>
               <dataUltimaSaidaEstoque></dataUltimaSaidaEstoque>
               <codigoPedidoNBS></codigoPedidoNBS>
               <codigoPedidoSAP></codigoPedidoSAP>
            </item>
            <item>
               <codigoItem>09129463</codigoItem>
               <quantidade>101</quantidade>
               <tipoItem>1</tipoItem>
               <precoCusto>27.950</precoCusto>
               <precoCustoMedio>9.523</precoCustoMedio>
               <precoVenda>389.000</precoVenda>
               <tipoRegistroMovimentacao>0001</tipoRegistroMovimentacao>
               <codigoFilialNBS>10964940000154</codigoFilialNBS>
               <dataUltimaSaidaEstoque></dataUltimaSaidaEstoque>
               <codigoPedidoNBS></codigoPedidoNBS>
               <codigoPedidoSAP></codigoPedidoSAP>
            </item>
            <item>
               <codigoItem>09129634</codigoItem>
               <quantidade>100</quantidade>
               <tipoItem>1</tipoItem>
               <precoCusto>2.762</precoCusto>
               <precoCustoMedio>9.075</precoCustoMedio>
               <precoVenda>6.780</precoVenda>
               <tipoRegistroMovimentacao>0001</tipoRegistroMovimentacao>
               <codigoFilialNBS>10964940000154</codigoFilialNBS>
               <dataUltimaSaidaEstoque></dataUltimaSaidaEstoque>
               <codigoPedidoNBS></codigoPedidoNBS>
               <codigoPedidoSAP></codigoPedidoSAP>
            </item>
            <item>
               <codigoItem>09104454</codigoItem>
               <quantidade>2</quantidade>
               <tipoItem>1</tipoItem>
               <precoCusto>22.985</precoCusto>
               <precoCustoMedio>20.624</precoCustoMedio>
               <precoVenda>58.110</precoVenda>
               <tipoRegistroMovimentacao>0001</tipoRegistroMovimentacao>
               <codigoFilialNBS>10964940000154</codigoFilialNBS>
               <dataUltimaSaidaEstoque></dataUltimaSaidaEstoque>
               <codigoPedidoNBS></codigoPedidoNBS>
               <codigoPedidoSAP></codigoPedidoSAP>
            </item>
            <item>
               <codigoItem>09122692</codigoItem>
               <quantidade>2</quantidade>
               <tipoItem>1</tipoItem>
               <precoCusto>44.132</precoCusto>
               <precoCustoMedio>37.425</precoCustoMedio>
               <precoVenda>131.130</precoVenda>
               <tipoRegistroMovimentacao>0001</tipoRegistroMovimentacao>
               <codigoFilialNBS>10964940000154</codigoFilialNBS>
               <dataUltimaSaidaEstoque></dataUltimaSaidaEstoque>
               <codigoPedidoNBS></codigoPedidoNBS>
               <codigoPedidoSAP></codigoPedidoSAP>
            </item>
            <item>
               <codigoItem>09164143</codigoItem>
               <quantidade>2</quantidade>
               <tipoItem>1</tipoItem>
               <precoCusto>20.229</precoCusto>
               <precoCustoMedio>20.663</precoCustoMedio>
               <precoVenda>60.110</precoVenda>
               <tipoRegistroMovimentacao>0001</tipoRegistroMovimentacao>
               <codigoFilialNBS>10964940000154</codigoFilialNBS>
               <dataUltimaSaidaEstoque></dataUltimaSaidaEstoque>
               <codigoPedidoNBS></codigoPedidoNBS>
               <codigoPedidoSAP></codigoPedidoSAP>
            </item>
            <item>
               <codigoItem>00457049</codigoItem>
               <quantidade>1</quantidade>
               <tipoItem>1</tipoItem>
               <precoCusto>72.957</precoCusto>
               <precoCustoMedio>65.288</precoCustoMedio>
               <precoVenda>122.980</precoVenda>
               <tipoRegistroMovimentacao>0001</tipoRegistroMovimentacao>
               <codigoFilialNBS>10964940000154</codigoFilialNBS>
               <dataUltimaSaidaEstoque></dataUltimaSaidaEstoque>
               <codigoPedidoNBS></codigoPedidoNBS>
               <codigoPedidoSAP></codigoPedidoSAP>
            </item>
            </item>
            </item>
         </item>
      </wsd:AtualizarEstoque>
   </soapenv:Body>
</soapenv:Envelope>
